using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace task3
{
    class Program
    {
        static void Main(string[] args)
        {
            Random rand = new Random();
            List<Student> students = new List<Student>();
            #region Заполняшка Листа
            string[] firstName =
            {
                "Алан","Георгий","Константин","Роман",
                "Александр","Герман","Лев","Ростислав",
                "Алексей","Глеб","Леонид","Руслан",
                "Альберт","Гордей","Макар","Рустам",
                "Анатолий","Григорий","Максим","Савва",
                "Андрей","Давид","Марат","Савелий",
                "Антон","Дамир","Марк","Святослав",
                "Арсен","Даниил","Марсель","Семен",
                "Арсений","Демид","Матвей","Сергей",
                "Артем","Демьян","Мирон","Станислав",
                "Артемий","Денис","Мирослав","Степан",
                "Артур","Дмитрий","Михаил","Тамерлан",
                "Богдан","Евгений","Назар","Тимофей",
                "Борис","Егор","Никита","Тимур",
                "Вадим","Елисей","Николай","Тихон",
                "Валентин","Захар","Олег","Федор",
                "Валерий","Иван","Павел","Филипп",
                "Василий","Игнат","Петр","Шамиль",
                "Виктор","Игорь","Платон","Эдуард",
                "Виталий","Илья","Прохор","Эльдар",
                "Владимир","Ильяс","Рамиль","Эмиль",
                "Владислав","Камиль","Ратмир","Эрик",
                "Всеволод","Карим","Ринат","Юрий",
                "Вячеслав","Кирилл","Роберт","Ян",
                "Геннадий","Клим","Родион","Ярослав"
            };
            string[] lastName = {
                            "Смирнов","Орехов","Денисов","Белоусов","Авдеев","Лазарев","Горшков","Кузьмин",
                            "Иванов","Ефремов","Громов","Федотов","Зыков","Медведев","Чернов","Кудрявцев",
                            "Кузнецов","Исаев","Фомин","Дорофеев","Бирюков","Ершов","Овчинников","Баранов",
                            "Соколов","Евдокимов","Давыдов","Егоров","Шарапов","Никитин","Селезнёв","Куликов",
                            "Попов","Калашников","Мельников","Матвеев","Никонов","Соболев","Панфилов","Алексеев",
                            "Лебедев","Кабанов","Щербаков","Бобров","Щукин","Рябов","Копылов","Степанов",
                            "Козлов","Носков","Блинов","Дмитриев","Дьячков","Поляков","Михеев","Яковлев",
                            "Новиков","Юдин","Колесников","Калинин","Одинцов","Цветков","Галкин","Сорокин",
                            "Морозов","Кулагин","Карпов","Анисимов","Сазонов","Данилов","Назаров","Сергеев",
                            "Петров","Лапин","Афанасьев","Петухов","Якушев","Жуков","Лобанов","Романов",
                            "Волков","Прохоров","Власов","Антонов","Красильников","Фролов","Лукин","Захаров",
                            "Соловьёв","Нестеров","Маслов","Тимофеев","Гордеев","Журавлёв","Беляков","Борисов",
                            "Васильев","Харитонов","Исаков","Никифоров","Самойлов","Николаев","Потапов","Королёв",
                            "Зайцев","Агафонов","Тихонов","Веселов","Князев","Крылов","Некрасов","Герасимов",
                            "Павлов","Муравьёв","Аксёнов","Филиппов","Беспалов","Максимов","Хохлов","Пономарёв",
                            "Семёнов","Ларионов","Гаврилов","Марков","Уваров","Сидоров","Жданов","Григорьев",
                            "Голубев","Федосеев","Родионов","Большаков","Шашков","Осипов","Ситников",
                            "Виноградов","Зимин","Котов","Суханов","Наумов","Сысоев","Симонов",
                            "Богданов","Пахомов","Горбунов","Миронов","Шилов","Фомичёв","Мишин",
                            "Воробьёв","Шубин","Кудряшов","Ширяев","Воронцов","Русаков","Фадеев",
                            "Фёдоров","Игнатов","Быков","Александров","Ермаков","Стрелков","Комиссаров",
                            "Михайлов","Филатов","Зуев","Коновалов","Дроздов","Гущин","Мамонтов",
                            "Беляев","Крюков","Третьяков","Шестаков","Игнатьев","Тетерин","Носов",
                            "Тарасов","Рогов","Савельев","Казаков","Савин","Колобов","Гуляев",
                            "Белов","Кулаков","Панов","Ефимов","Логинов","Субботин","Шаров",
                            "Комаров","Терентьев","Рыбаков","Бобылёв","Сафонов","Фокин","Устинов",
                            "Орлов","Молчанов","Суворов","Доронин","Капустин","Блохин","Вишняков",
                            "Киселёв","Владимиров","Абрамов","Белозёров","Кириллов","Селиверстов","Евсеев",
                            "Макаров","Артемьев","Воронов","Рожков","Моисеев","Пестов","Лаврентьев",
                            "Андреев","Гурьев","Мухин","Самсонов","Елисеев","Кондратьев","Брагин",
                            "Ковалёв","Зиновьев","Архипов","Мясников","Кошелев","Силин","Константинов",
                            "Ильин","Гришин","Трофимов","Лихачёв","Костин","Меркушев","Корнилов",
                            "Гусев","Кононов","Мартынов","Буров","Горбачёв","Лыткин",
                            "Титов","Дементьев","Емельянов","Туров"
                        };
            int strundetsCount = rand.Next(10,100);
            for (int i = 0; i < strundetsCount; i++)
            {
                int age, group=0;
                age = rand.Next(17, 24);
                switch (age)
                {
                    case 17: {
                            group = 100;
                            break; }
                    case 18: {
                            group = 200;
                            break; }
                    case 19: {
                            group = 300;
                            break; }
                    case 20: {
                            group = 400;
                            break; }
                    case 21: {
                            group = 500;
                            break; }
                    case 22: {
                            group = 600;
                            break; }
                    case 23: {
                            group = 700;
                            break; }

                }
                group += rand.Next(20, 25);
                students.Add(new Student(
                    firstName[rand.Next(0, firstName.Length)],
                    lastName[rand.Next(0,lastName.Length)],
                    age,
                    group
                    ));
            }
            Console.WriteLine("Group FirstName   LastName       Age");
            int groupTab = 0;
            foreach (var item in students.OrderBy(u => u.Group))
            {
                if (groupTab != item.Group && groupTab != 0) Console.Write("\n");
                Console.Write("{0, -6}",item.Group);
                Console.Write("{0, -12}",item.FirstName);
                Console.Write("{0, -15}", item.LastName);
                Console.Write("{0}\n", item.Age);
                groupTab = item.Group;
            }
            Console.WriteLine($"Всего студентов: {students.Count}");
            #endregion
            //Закидываем все это добро в двоичное дерево
            BinaryTree tree = new BinaryTree();
            foreach (var item in students)
            {
                tree.Insert(item.Age, item);
            }
            BinaryTreeExtensions.Print(tree);
            Console.Write("Введите возраст студентов, которых нужно найти: ");
            var finded = tree.Find(long.Parse(Console.ReadLine()));
            foreach (var item in finded.Students)
            {
                Console.WriteLine($"Имя: {item.FirstName} {item.LastName} Группа: {item.Group} Возраст:{item.Age}");
            }
            Console.ReadKey();
        }
    }
    public class Student
    {
        public string FirstName { get; set; }
        public string LastName { get; set; }
        public int Age { get; set; }
        public int Group { get; set; }
        public Student(string firstName, string lastName,int age,int group)
        {
            FirstName = firstName;
            LastName = lastName;
            Age = age;
            Group = group;
        }
    }
}
